# usage
#
# リストにあるものをinstall
# > brew bundle
#
# 不要なものを削除
# > brew bundle cleanup

# taps
# tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "koekeishiya/formulae"

# brew
brew "coreutils"
# brew "asdf"
brew "axel"
brew "bat"
brew "lsd"
brew "cpufetch"
# brew "fish"
# brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "python@3.12"
# brew "ranger"
brew "rename"
brew "scala"
brew "tmux"
brew "tree"
brew "unar"
brew "yarn"
brew "coursier/formulas/coursier"
brew "fzf"
brew "zoxide"
# brew "yabai"
# brew "skhd"


# cask
cask "font-fira-code"
cask "iterm2"
cask "librewolf"
cask "slack"
# cask "stats"
cask "1password"
cask "ableton-live-suite"
cask "adobe-acrobat-reader"
cask "alfred"
cask "alt-tab"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "deepl"
cask "docker"
cask "dropbox"
# cask "dropzone"
cask "google-chrome"
cask "iina"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "messenger"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-word"
cask "postman"
cask "slack"
# cask "steam"
cask "surfshark"
cask "the-unarchiver"
cask "todoist"
cask "tor-browser"
cask "transcribe"
# cask "elektron-transfer"
# cask "elektron-overbridge"
cask "vlc"
cask "waterfox"
cask "iterm2"
cask "zoom"
# cask "visual-studio-code-insiders"
cask "visual-studio-code"
cask "ocenaudio"
cask "warp"

# mas
# masを使うにはmasをinstallしてから
brew "mas"
mas "Magnet", id: 441258766
mas "Display Menu" , id:549083868
mas "Dropover", id:1355679052
mas "Music Converter Pro", id:468990782
mas "LINE", id:539883307


# fonts
cask "font-Hack-nerd-font"
cask "font-noto-sans-cjk"
cask "font-fira-code"
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
