# usage
# > brew bundle
#
tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "coreutils"
# brew "asdf"
brew "axel"
# brew "bat"
# brew "fish"
# brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "python@3.11"
# brew "ranger"
brew "rename"
brew "scala"
brew "tmux"
brew "tree"
brew "unar"
brew "yarn"
brew "coursier/formulas/coursier"
cask "font-fira-code"
cask "iterm2"
cask "librewolf"
cask "slack"
cask "stats"
cask "1password"
cask "ableton-live-suite"
cask "adobe-acrobat-reader"
cask "alfred"
cask "alt-tab"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "deepl"
cask "docker"
cask "dropbox"
cask "dropzone"
cask "google-chrome"
cask "iina"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "messenger"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-word"
cask "postman"
cask "slack"
cask "stats"
cask "steam"
cask "surfshark"
cask "the-unarchiver"
cask "todoist"
cask "tor-browser"
cask "transcribe"
cask "elektron-transfer"
cask "elektron-overbridge"
cask "vlc"
cask "visual-studio-code"
cask "waterfox"
cask "iterm2"
cask "zoom"
